app/views/menu/_menu.html.erb

SELECT `pages`.* FROM `pages` WHERE `pages`.`show_above_main` = 1
---
        <ul>
          <% temp_page = Page.where(:show_above_main => true) %>

SELECT `novelty_categories`.* FROM `novelty_categories` ORDER BY sort LIMIT 1
---
        <ul>
          <% temp = NoveltyCategory.order(:sort) %>

SELECT `menu_ups`.* FROM `menu_ups` ORDER BY sort
---
      </li>
      <% menu_temp = MenuUp.order(:sort) %>

SELECT `pages`.* FROM `pages` WHERE `pages`.`name_url` = 'Stranichechka' LIMIT 1
---
                  <% else %>
                    <%= link_to down.name, page_path(down.name_url,down.page.name_url) %>