app/views/welcome/index.html.erb

SELECT `novelties`.* FROM `novelties` WHERE `novelties`.`show_status` = 1 AND `novelties`.`cool_news` = 1 ORDER BY rand() LIMIT 4
---
      <ul>
        <% temp_news = Novelty.where(:show_status => true, :cool_news => true).order("rand()").limit(4) %>