app/controllers/novelties_controller.rb

SELECT `novelty_categories`.* FROM `novelty_categories` ORDER BY sort LIMIT 1
SELECT `novelties`.* FROM `novelties` WHERE `novelties`.`show_status` = 1 AND `novelties`.`novelty_category_id` = 1 LIMIT 10 OFFSET 0
---
  def index
    cat_temp = NoveltyCategory.order(:sort).first
    unless cat_temp
      redirect_to root_path
      return
    end
    cat_id = (params[:id].to_i > 0 ? params[:id].to_i : cat_temp.id)
    @novelties = Novelty.where(:show_status => true, :novelty_category_id => cat_id).paginate(:per_page => 10, :page => params[:page])

SELECT `novelties`.* FROM `novelties` WHERE `novelties`.`id` = 1 LIMIT 1
---
  def show
    @novelty = Novelty.find_by_id(params[:id])