app/controllers/welcome_controller.rb

SELECT `pages`.* FROM `pages` WHERE `pages`.`name_url` = 'Stranichechka' LIMIT 1
SELECT `menu_downs`.* FROM `menu_downs` WHERE `menu_downs`.`name_url` = 'Stranichechka' LIMIT 1
---
  def page
    @page = Page.where(:name_url => params[:name_url]).first
    if params[:menu_url].to_s == "main"
      @menu = nil
    else
      @menu = MenuDown.where(:name_url => params[:menu_url]).first

SELECT `menu_ups`.* FROM `menu_ups` WHERE `menu_ups`.`name_url` = 'Verhnee_menyu_1' ORDER BY sort LIMIT 1
---
  def menu
    @menu = MenuUp.where(:name_url => params[:name_url]).first